#include <iostream>
#include <string.h>

int main() {
	// А) Въведете абсолютен път на файл (примерно /D/Programming/FMI/UP/Practice/strings.cpp)
	// Запишете го в буферен статичен масив. След това го прехвърлете
	// в динамично заделен масив с точната дължина.
	
	// Б) Изпишете имената на директориите в пътя
	
	// В) Въведете име на търсена директория. Потърсете дали тя съществува
	// в пътя на файла.
	
	// Г) Въведете тип на файл, демек неговият extension.
	// Проверете дали файла е с този тип, който преди малко сте въвели.


	return 0;
}
